app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings"  WHERE (meeting_room_id = 1 AND end_time >= '2014-08-11 07:21:13.433719')  ORDER BY "bookings"."start_time" ASC
---
  def index
    @bookings = Booking.where("meeting_room_id = ? AND end_time >= ?", @meeting_room.id, Time.now).order(:start_time)

INSERT INTO "bookings" ("end_time", "length", "meeting_room_id", "start_time") VALUES (?, ?, ?, ?)  [["end_time", "2014-08-12 07:29:00.000000"], ["length", 0], ["meeting_room_id", 1], ["start_time", "2014-08-12 07:30:00.000000"]]
---
  def create
    @booking =  Booking.new(params[:booking].permit(:meeting_room_id, :start_time, :length))
    @booking.meeting_room = @meeting_room
    if @booking.save

DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 3]]
SELECT  "bookings".* FROM "bookings"  WHERE "bookings"."id" = ? LIMIT 1  [["id", 3]]
---
  def destroy
    @booking = Booking.find(params[:id]).destroy

SELECT  "bookings".* FROM "bookings"  WHERE "bookings"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    @booking = Booking.find(params[:id])

SELECT  "bookings".* FROM "bookings"  WHERE "bookings"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "bookings" SET "end_time" = ?, "length" = ?, "start_time" = ? WHERE "bookings"."id" = 4  [["end_time", "2014-08-13 04:59:00.000000"], ["length", 3], ["start_time", "2014-08-13 02:00:00.000000"]]
---
  def update
    @booking = Booking.find(params[:id])
    # @booking.meeting_room = @meeting_room

    if @booking.update(params[:booking].permit(:meeting_room_id, :start_time, :length))

SELECT  "meeting_rooms".* FROM "meeting_rooms"  WHERE "meeting_rooms"."id" = 1 LIMIT 1
---
  def find_meeting_room
    if params[:meeting_room_id]
      @meeting_room = MeetingRoom.find_by_id(params[:meeting_room_id])