app/controllers/home_controller.rb

SELECT "meeting_rooms".* FROM "meeting_rooms"
---
	def index
    @meeting_rooms = MeetingRoom.all