app/controllers/meeting_rooms_controller.rb

  def index
    @meeting_rooms = MeetingRoom.all
---
SELECT "meeting_rooms".* FROM "meeting_rooms"

  def create
    @meeting_room = MeetingRoom.create(meeting_room_params)
---
INSERT INTO "meeting_rooms" ("name") VALUES (?)  [["name", "samepage"]]

  def destroy
    @meeting_room = MeetingRoom.find(params[:id])
    @meeting_room.destroy
---
SELECT  "meeting_rooms".* FROM "meeting_rooms"  WHERE "meeting_rooms"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "meeting_rooms" WHERE "meeting_rooms"."id" = ?  [["id", 2]]

  def edit
    @meeting_room = MeetingRoom.find(params[:id])
---
SELECT  "meeting_rooms".* FROM "meeting_rooms"  WHERE "meeting_rooms"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @meeting_room = MeetingRoom.find(params[:id])
---
SELECT  "meeting_rooms".* FROM "meeting_rooms"  WHERE "meeting_rooms"."id" = ? LIMIT 1  [["id", 1]]